app/Models/BukuModel.php

SELECT *
FROM `buku`
JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
SELECT *
FROM `buku`
JOIN `rak` ON `rak`.`id_rak` = `buku`.`id_rak`
WHERE `buku`.`id_buku` IS NULL
---
    public function getBuku($id = false)
    {
        if ($id === false) {
            return $this->table('buku')
                        ->join('rak', 'rak.id_rak = buku.id_rak')
                        ->get()
                        ->getResult();
        }
        else {
            return $this->table('buku')
                        ->join('rak', 'rak.id_rak = buku.id_rak')
                        ->where('buku.id_buku', $id)
                        ->get()
                        ->getRow();

UPDATE `buku` SET `stok` = 51
WHERE `id_buku` = '4'
---
    public function updateStok($id, $stok)
    {
        $data['stok'] = $stok;
        return $this->db->table($this->table)->update($data, ['id_buku' => $id]);