app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
JOIN `buku` ON `buku`.`id_buku` = `transaksi`.`id_buku`
SELECT *
FROM `transaksi`
JOIN `buku` ON `buku`.`id_buku` = `transaksi`.`id_buku`
WHERE `transaksi`.`id_transaksi` = '1'
---
    public function getTransaksi($id = false)
    {
        if ($id === false) {
            return $this->table('transaksi')
                        ->join('buku', 'buku.id_buku = transaksi.id_buku')
                        ->get()
                        ->getResult();
        }
        else {
            return $this->table('transaksi')
                        ->join('buku', 'buku.id_buku = transaksi.id_buku')
                        ->where('transaksi.id_transaksi', $id)
                        ->get()
                        ->getRow();

DELETE FROM `transaksi`
WHERE `id_transaksi` = '1'
---
    public function deleteTransaksi($id)
    {
        return $this->db->table($this->table)->delete(['id_transaksi' => $id]);